from social_analyst.keyword_extractor import KeywordExtractor

if __name__ == "__main__":
    comments = [
        "This coffee looks so delicious!",
        "Wow the packaging is super cute 😍",
        "ราคาเท่าไหร่คะ?",
        "I want to try this flavor",
        "ชอบรสชานมมากกกก",
        "พูดหมดทุกอย่าง ที่ไม่พูดคือมีคนแนะนำให้รู้ธรรมนัส และได้มาช่วยงานนี้ปั๋วล็อตเตอรี่ ทำงานดีจนเป็นที่รักของธรรมนัส นั่นแหละถึงได้เป็นกัน จอมพลัง วันนี้",
        "เขาเกิดมาเพื่อเป็นกันจอมพลัง",
        "บะหมี่จอมพลังอร่อยมาก ตลาดนัดรถไฟ ศรีนครินทร์ เคยกินเมื่อน่าจะเกือบ10ปีก่อน",
        "แล้วพนักงานที่โกงล่ะคับ ปัจจุบันโดนอะไรไหม",
        "ข้อมูล ยังไม่ลึก แปลว่าทีมงาน ไม่ทำการบ้าน จุดเปลี่ยนของ กัน จอมพลัง ไม่ใช่ แบบนี้",
        "กันจอมพลัง+ท่านชัชชาติ🔥",
        "พึ่งรู้ประวัติกันจอมพลังจากคลิปนี้เลย นึกว่าเขาเป็นลูกคนรวยอยู่แล้ว สุดยอดมาก",
        "ประชาชน เดือดร้อนคำแรก กันจอมพลัง ไม่ใช่ตำรวจ นักการเมือง",
        "พอฟังประวัติ พี่แกยิ่งเท่เลยวะ",
        "ให้กันจอมพลัง เป็นนายกแทนนางอิ๊ง"
    ]

    extractor = KeywordExtractor()
    keywords = extractor.extract_keywords(comments, top_n=5)

    print("🔍 Keywords เด่น:")
    for kw in keywords:
        print(f"- {kw}")
